# ================================================================================
# 문자열 뒤에 $를 붙여 출력하는 코드
a = 'abcd'

alen = len(a)
for i in range(0, alen):
    print(a[i] + '$', end='')

# ================================================================================
# 문자열을 입력받아 반대로 출력하는 코드
inStr, outStr = '', ''
count, i = 0, 0

inStr = input("문자열 입력 : ")
count = len(inStr)

for i in range(0, count):
    outStr += inStr[count - (i+1)]

print("내용을 반대로 출력 : " + outStr)
# ================================================================================
# 문자열을 대소문자로 변환
slStr = "Python is fun!"

# 모두 대문자
slStr.upper()
# 모두 소문자
slStr.lower()
# 대문자 -> 소문자 and 소문자 -> 대문자
slStr.swapcase()
# 첫 번째 글자만 대문자
slStr.title()
# ================================================================================
# 공백문자 제거히기
ss = 'python is fun'

result = ss.replace(" ", "")
print(result)
# ================================================================================
# 리스트에 값을 하나씩 더해서 새로운 리스트를 만드는 작업
myList = [1, 2, 3, 4, 5]
result1 = []
for val in myList:
    result1.append(val + 1)

print(f'result1 : {result1}')
# map 함수
def add_one(n):
    return n + 1

# map반환을 list 로 변환
result2 = list(map(add_one, myList))
print(f'result2 : {result2}')
# ================================================================================
def cal(i, j, o):
    if o == '+':
        return i+j
    elif o == '*':
        return i*j

print(cal(4, 5, '*'))
# ================================================================================
def p(a, b, c=0):
    return a+b+c

print(p(1, 1, 1))
# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================